fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда

		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(
			Метаданные.Документы.РеализацияТоваровУслуг);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";

		Возврат КомандаСоздатьНаОсновании;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	
	//++ Двоенко Диплом_ВКМ
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//++ Двоенко Диплом_ВКМ
	// Акт об оказанных услугах
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 5;
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++ Двоенко Диплом_ВКМ
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Акт");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_ВКМ_Акт";
	КонецЕсли;
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	//++ Двоенко Диплом_ВКМ
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТранспортнаяНакладная";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_ВКМ_Акт");

	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);

	ПервыйДокумент = Истина;

	Пока ДанныеДокументов.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ВывестиЗаголовок(ДанныеДокументов, ТабличныйДокумент, Макет);

		ВывестиНоменклатуру(ДанныеДокументов, ТабличныйДокумент, Макет);

		ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеДокументов.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	//-- Двоенко Диплом_ВКМ

КонецФункции

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	
	//++ Двоенко Диплом_ВКМ
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Возврат Запрос.Выполнить().Выбрать();
	//-- Двоенко Диплом_ВКМ

КонецФункции

Процедура ВывестиЗаголовок(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ Двоенко Диплом_ВКМ
	ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");

	ДанныеПечати = Новый Структура;

	ШаблонЗаголовка = "Акт об оказанных услугах № %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
	ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);

	ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);

	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

Процедура ВывестиНоменклатуру(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ Двоенко Диплом_ВКМ
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

	ВыборкаНоменклатура = ДанныеДокументов.Услуги.Выбрать();
	Пока ВыборкаНоменклатура.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаНоменклатура);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

Процедура ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ Двоенко Диплом_ВКМ
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	ДанныеПечати = Новый Структура;
	ВыборкаНоменклатура = ДанныеДокументов.Услуги.Выгрузить();
	СуммаУслуг = ВыборкаНоменклатура.Итог("Сумма");
	ШаблонИтого = СтрШаблон("%1 руб. (%2)", Формат(СуммаУслуг, "ЧДЦ=2; ЧГ=3,0;"), ЧислоПрописью(СуммаУслуг, "Л = ru_RU",
		"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	ДанныеПечати.Вставить("Итого", ШаблонИтого);

	ОбластьПодвал.Параметры.Заполнить(ДанныеПечати);

	ТабличныйДокумент.Вывести(ОбластьПодвал);
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

Функция СоздатьРеализациюТоваровИУслуг(СписокДоговоров) Экспорт
	//++ Двоенко Диплом_ВКМ
	
	Сообщения = Новый Массив;

	Для Каждого Строка Из СписокДоговоров Цикл
		Договор = Строка.Договор;

		НовыйДокумент = СоздатьДокумент();

		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Организация", Договор.Организация);
		ДанныеЗаполнения.Вставить("Контрагент", Договор.Владелец);
		ДанныеЗаполнения.Вставить("Договор", Договор);
		НовыйДокумент.Заполнить(ДанныеЗаполнения);

		НовыйДокумент.Дата = КонецМесяца(Строка.Период); // Через ДанныеЗаполнения не заполняет
		ТекстКомментария = СтрШаблон("Документ создан обработкой Массовое создание актов %1", ТекущаяДатаСеанса());
		НовыйДокумент.Комментарий = ТекстКомментария; // Через ДанныеЗаполнения не заполняет

		НовыйДокумент.ВыполнитьАвтозаполнение();

		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			ТекстСообщения = СтрШаблон("Создан документ: %1", НовыйДокумент.Ссылка);
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не удалось создать документ Реализация товаров и услуг по договору: %1, организация: %2, контрагент: %3 за период: %4",
				Договор, Договор.Организация, Договор.Владелец, Строка.Период);
		КонецЕсли;
		Сообщения.Добавить(ТекстСообщения);
	КонецЦикла;

	Возврат Сообщения;
	//-- Двоенко Диплом_ВКМ
КонецФункции

#КонецОбласти

#КонецЕсли
